app/Controllers/Home.php

SELECT *
FROM `parents`
---
    public function index()
    {
        $parents = new ParentsModel();

        $data['parents'] = $parents->findAll();

INSERT INTO `members` (`name`, `parent_id`) VALUES ('Spiderman', '4')
---
    public function add_member()
    {
        $name = $this->request->getPost('m_name');
        $parent_id = $this->request->getPost('parent');

        $data =[
            'name' => $name,
            'parent_id' => $parent_id
        ];

        $members = new MembersModel();
        $members->insert($data);